000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID. P18AP01.                                             00020000
000300 DATA DIVISION.                                                   00030000
000400 WORKING-STORAGE SECTION.                                         00040000
000500 01  WS-CA       PIC X(01).                                       00050000
000600 01  WS-IN1      PIC 9(02).                                       00060000
000700 01  WS-IN1O REDEFINES WS-IN1 PIC X(02).                          00070000
000800 01  WS-IN2      PIC 9(02).                                       00080000
000900 01  WS-IN2O REDEFINES WS-IN2 PIC X(02).                          00090000
001000 01  WS-OUTA     PIC 9(03).                                       00100000
001100 01  WS-OUTB     PIC 9(03).                                       00110000
001200 01  WS-OUTC     PIC 9(03).                                       00120000
001300 01  WS-OUTD     PIC 9(03).                                       00130000
001400 01  WS-MESSAGE  PIC X(30) VALUE                                  00140000
001500     'END OF THE PROGRAM, BYE, BYE!!'.                            00150000
001600     COPY P18AS01.                                                00160000
001700     COPY DFHAID.                                                 00170000
001800 LINKAGE SECTION.                                                 00180000
001900 01  DFHCOMMAREA     PIC X(01).                                   00190000
002000 PROCEDURE DIVISION.                                              00200000
002100 MAIN-PARA.                                                       00210000
002200     IF EIBCALEN = ZERO                                           00220000
002300         PERFORM FIRST-PARA                                       00230000
002400     ELSE                                                         00240000
002500         PERFORM NEXT-PARA.                                       00250000
002600 END-PARA.                                                        00260000
002700     EXEC CICS RETURN                                             00270000
002800         TRANSID('P18A')                                          00280000
002900         COMMAREA(WS-CA)                                          00290000
003000     END-EXEC.                                                    00300000
003100 FIRST-PARA.                                                      00310000
003200     MOVE LOW-VALUES TO CALMAPO                                   00320000
003300      PERFORM SEND-MAP.                                           00330000
003400 SEND-MAP.                                                        00340000
003500     EXEC CICS SEND                                               00350000
003600         MAP('CALMAP')                                            00360000
003700         MAPSET('P18AS01')                                        00370000
003800         FROM (CALMAPO)                                           00380000
003900         ERASE                                                    00390000
004000     END-EXEC.                                                    00400000
004100 NEXT-PARA.                                                       00410000
004200     IF EIBAID = DFHPF3                                           00420000
004300*        EXEC CICS SEND TEXT                                      00430003
004400*            FROM(WS-MESSAGE)                                     00440003
004500*            ERASE                                                00450003
004600*        END-EXEC                                                 00460003
004700*        EXEC CICS RETURN                                         00470003
004800*        END-EXEC                                                 00480003
004900                 EXEC CICS XCTL                                   00490003
005000                     PROGRAM('P18AP02')                           00500003
005100                 END-EXEC                                         00510003
005200     ELSE                                                         00520000
005300     IF EIBAID = DFHENTER                                         00530000
005400         PERFORM PROCESS-PARA                                     00540000
005500     ELSE                                                         00550000
005600         MOVE 'INVALID KEY PRESSED' TO MESSAGEO.                  00560000
005700     PERFORM SEND-MAP.                                            00570000
005800*                                                                 00580000
005900 ADD-PARA.                                                        00590000
006000     IF INPUT1L = ZERO OR INPUT2L = ZERO                          00600000
006100         MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO             00610000
006200     ELSE                                                         00620000
006300        IF INPUT1I IS NUMERIC AND INPUT2I IS NUMERIC              00630000
006400             MOVE INPUT1I TO WS-IN1O                              00640000
006500             MOVE INPUT2I TO WS-IN2O                              00650000
006600             COMPUTE WS-OUTA = WS-IN1 + WS-IN2                    00660000
006700             MOVE WS-OUTA  TO ADD1O                               00670000
006800*            MOVE 'SUM OF 2 NUMBERS IS DISPLAYED' TO MESSAGEO     00680004
006900        ELSE                                                      00690000
007000             MOVE 'INPUTS ARE NOT NUMERIC' TO MESSAGEO.           00700000
007100*                                                                 00710000
007200 SUB-PARA.                                                        00720000
007300     IF INPUT1L = ZERO OR INPUT2L = ZERO                          00730000
007400         MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO             00740000
007500     ELSE                                                         00750000
007600        IF INPUT1I IS NUMERIC AND INPUT2I IS NUMERIC              00760000
007700             MOVE INPUT1I TO WS-IN1O                              00770000
007800             MOVE INPUT2I TO WS-IN2O                              00780000
007900             COMPUTE WS-OUTB =  WS-IN1 - WS-IN2                   00790000
008000             MOVE WS-OUTB  TO SUB1O                               00800000
008100             MOVE 'SUB OF 2 NUMBERS IS DISPLAYED' TO MESSAGEO     00810000
008200        ELSE                                                      00820000
008300             MOVE 'INPUTS ARE NOT NUMERIC' TO MESSAGEO.           00830000
008400*                                                                 00840000
008500 MUL-PARA.                                                        00850000
008600     IF INPUT1L = ZERO OR INPUT2L = ZERO                          00860000
008700         MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO             00870000
008800     ELSE                                                         00880000
008900        IF INPUT1I IS NUMERIC AND INPUT2I IS NUMERIC              00890000
009000             MOVE INPUT1I TO WS-IN1O                              00900000
009100             MOVE INPUT2I TO WS-IN2O                              00910000
009200             COMPUTE WS-OUTC = WS-IN1 * WS-IN2                    00920000
009300             MOVE WS-OUTC  TO MULO                                00930000
009400             MOVE 'MUL OF 2 NUMBERS IS DISPLAYED' TO MESSAGEO     00940000
009500        ELSE                                                      00950000
009600             MOVE 'INPUTS ARE NOT NUMERIC' TO MESSAGEO.           00960000
009700*                                                                 00970000
009800 DIV-PARA.                                                        00980000
009900     IF INPUT1L = ZERO OR INPUT2L = ZERO                          00990000
010000         MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO             01000000
010100     ELSE                                                         01010000
010200        IF INPUT1I IS NUMERIC AND INPUT2I IS NUMERIC              01020000
010300             MOVE INPUT1I TO WS-IN1O                              01030000
010400             MOVE INPUT2I TO WS-IN2O                              01040000
010500             COMPUTE WS-OUTD = WS-IN1 / WS-IN2                    01050000
010600             MOVE WS-OUTD  TO DIVO                                01060001
010700             MOVE 'DIV OF 2 NUMBERS IS DISPLAYED' TO MESSAGEO     01070002
010800        ELSE                                                      01080000
010900             MOVE 'INPUTS ARE NOT NUMERIC' TO MESSAGEO.           01090000
011000*                                                                 01100000
011100 PROCESS-PARA.                                                    01110000
011200     PERFORM RECEIVE-MAP.                                         01120000
011300     PERFORM ADD-PARA.                                            01130000
011400     PERFORM SUB-PARA.                                            01140000
011500     PERFORM MUL-PARA.                                            01150000
011600     PERFORM DIV-PARA.                                            01160001
011700*    IF INPUT1L = ZERO OR INPUT2L = ZERO                          01170000
011800*        MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO             01180000
011900*    ELSE                                                         01190000
012000*       IF INPUT1I IS NUMERIC AND INPUT2I IS NUMERIC              01200000
012100*            MOVE INPUT1I TO WS-IN1O                              01210000
012200*            MOVE INPUT2I TO WS-IN2O                              01220000
012300*            COMPUTE WS-OUT = WS-IN1 + WS-IN2                     01230000
012400*            MOVE WS-OUT  TO OUTPUTO                              01240000
012500*            MOVE 'SUM OF 2 NUMBERS IS DISPLAYED' TO MESSAGEO     01250000
012600*       ELSE                                                      01260000
012700*            MOVE 'INPUTS ARE NOT NUMERIC' TO MESSAGEO.           01270000
012800 RECEIVE-MAP.                                                     01280000
012900     EXEC CICS RECEIVE                                            01290000
013000         MAP('CALMAP')                                            01300000
013100         MAPSET('P18AS01')                                        01310000
013200         INTO(CALMAPI)                                            01320000
013300     END-EXEC.                                                    01330000
